structurizr-export/test/unit/com/structurizr/io/dot/groups-Containers.dot
digraph {
  compound=true
  graph [fontname="Arial", rankdir=TB, ranksep=1.0, nodesep=1.0]
  node [fontname="Arial", shape=box, margin="0.4,0.3"]
  edge [fontname="Arial"]
  label=<<br /><font point-size="34">D - Containers</font>>

  3 [id=3,shape=rect, label=<<font point-size="34">C</font><br /><font point-size="19">[Software System]</font>>, style=filled, color="#9a9a9a", fillcolor="#dddddd", fontcolor="#000000"]

  subgraph cluster_4 {
    margin=25
    label=<<font point-size="24"><br />D</font><br /><font point-size="19">[Software System]</font>>
    labelloc=b
    color="#444444"
    fontcolor="#444444"
    fillcolor="#444444"

    subgraph "cluster_group_Group 3" {
      margin=25
      label=<<font point-size="24"><br />Group 3</font><br /><font point-size="19">[Group]</font>>
      labelloc=b
      color="#cccccc"
      fontcolor="#cccccc"
      fillcolor="#ffffff"

      6 [id=6,shape=rect, label=<<font point-size="34">F</font><br /><font point-size="19">[Container]</font>>, style=filled, color="#9a9a9a", fillcolor="#dddddd", fontcolor="#000000"]
    }

    5 [id=5,shape=rect, label=<<font point-size="34">E</font><br /><font point-size="19">[Container]</font>>, style=filled, color="#9a9a9a", fillcolor="#dddddd", fontcolor="#000000"]
  }

  3 -> 5 [id=11, label=<>, style="dashed", color="#707070", fontcolor="#707070"]
  3 -> 6 [id=14, label=<>, style="dashed", color="#707070", fontcolor="#707070"]
}
