structurizr-export/test/unit/com/structurizr/io/plantuml/c4plantuml/groups-Containers.puml
@startuml
title D - Containers

top to bottom direction

!include https://raw.githubusercontent.com/plantuml-stdlib/C4-PlantUML/master/C4.puml
!include https://raw.githubusercontent.com/plantuml-stdlib/C4-PlantUML/master/C4_Context.puml
!include https://raw.githubusercontent.com/plantuml-stdlib/C4-PlantUML/master/C4_Container.puml

System(C, "C", "", $tags="Element+Software System")

System_Boundary("D_boundary", "D") {
  Boundary(group_2, "Group 3") {
    Container(D.F, "F", "", $tags="Element+Container")
  }

  Container(D.E, "E", "", $tags="Element+Container")
}

Rel_D(C, D.E, "", $tags="Relationship")
Rel_D(C, D.F, "", $tags="Relationship")

SHOW_LEGEND()
@enduml
